import { defineConfig } from 'vitepress'

export default defineConfig({
  head:[
    [
      'script',
      {
        defer: '',
        src: 'https://static.cloudflareinsights.com/beacon.min.js',
        'data-cf-beacon': `{"token":"${process.env.CF_ANALYTICS_TOKEN}"}`
      }
    ]
  ],
  title: "黑盒圣经&皮特弹幕",
  description: "desc",
  themeConfig: {
    search: {
      provider: 'local'
    },
    nav: [
      { text: 'Home', link: '/' },
      { text: '黑盒圣经', link: '/黑盒圣经/index' },
      { text: '皮特弹幕', link: '/pite/index'}
    ],

    sidebar: [
      {   
        text: '黑盒圣经', 
        collapsed: true,
        items: [
          { text: '黑盒圣经', link: '/黑盒圣经/index' },
          { 
            text: '2023年',
            collapsed: true,
            items:[
              {
                text: '4月',
                collapsed: true,
                items:[
                  { text: '电话线', link: '/黑盒圣经/2023年/4月/电话线' },
                ]
              },
              {
                text: '5月',
                collapsed: true,
                items:[
                  { text: '擦边', link: '/黑盒圣经/2023年/5月/擦边' },
                  { text: '拉一个群', link: '/黑盒圣经/2023年/5月/拉一个群' },
                  { text: '你可真有趣', link: '/黑盒圣经/2023年/5月/你可真有趣' },
                  { text: '删好了吗', link: '/黑盒圣经/2023年/5月/删好了吗' },
                  { text: '突然不想谈了', link: '/黑盒圣经/2023年/5月/突然不想谈了' },
                  { text: '我觉得不是嘴瓢', link: '/黑盒圣经/2023年/5月/我觉得不是嘴瓢' },
                ]
              },
              {
                text: '6月',
                collapsed: true,
                items:[
                  { text: '分手后你会哭吗', link: '/黑盒圣经/2023年/6月/分手后你会哭吗' },
                  { text: '可是我有手柄', link: '/黑盒圣经/2023年/6月/可是我有手柄' },
                  { text: '杀红眼了', link: '/黑盒圣经/2023年/6月/杀红眼了' },
                ]
              },
              {
                text: '7月',
                collapsed: true,
                items:[
                  { text: '能不能换个游戏', link: '/黑盒圣经/2023年/7月/能不能换个游戏' },
                ]
              },
              {
                text: '8月',
                collapsed: true,
                items:[
                  { text: '卧槽还能转账', link: '/黑盒圣经/2023年/8月/卧槽还能转账' },
                ]
              }
            ]
          },

          {
            text: '经典',
            collapsed: true,
            items:[
              {
                text: '经典1·名场面',
                collapsed: true,
                items:[
                  { text: '？6', link: '/黑盒圣经/经典/经典1·名场面/？6' },
                  { text: '铂金会员事件', link: '/黑盒圣经/经典/经典1·名场面/铂金会员事件' },
                  { text: '不能太内向', link: '/黑盒圣经/经典/经典1·名场面/不能太内向' },
                  { text: '不想了', link: '/黑盒圣经/经典/经典1·名场面/不想了' },
                  { text: '不许说她是', link: '/黑盒圣经/经典/经典1·名场面/不许说她是' },
                  { text: '干嘛呢', link: '/黑盒圣经/经典/经典1·名场面/干嘛呢' },
                  { text: '没完没了了是吧', link: '/黑盒圣经/经典/经典1·名场面/没完没了了是吧' },
                  { text: '你别恩将仇报', link: '/黑盒圣经/经典/经典1·名场面/你别恩将仇报' },
                  { text: '你和你姨妈就等着过瘾吧', link: '/黑盒圣经/经典/经典1·名场面/你和你姨妈就等着过瘾吧' },
                  { text: '你属什么', link: '/黑盒圣经/经典/经典1·名场面/你属什么' },
                  { text: '她似乎带点nt', link: '/黑盒圣经/经典/经典1·名场面/她似乎带点nt' },
                  { text: '要你微信', link: '/黑盒圣经/经典/经典1·名场面/要你微信' },
                  { text: '怎么可能看书', link: '/黑盒圣经/经典/经典1·名场面/怎么可能看书' },
                  { text: '最幸运的事', link: '/黑盒圣经/经典/经典1·名场面/最幸运的事' },
                ]
              },
              {
                text: '经典2',
                collapsed: true,
                items:[
                  { text: '粑粑', link: '/黑盒圣经/经典/经典2/粑粑' },
                  { text: '比热容', link: '/黑盒圣经/经典/经典2/比热容' },
                  { text: '不需要', link: '/黑盒圣经/经典/经典2/不需要' },
                  { text: '藏头诗', link: '/黑盒圣经/经典/经典2/藏头诗' },
                  { text: '成语接龙', link: '/黑盒圣经/经典/经典2/成语接龙' },
                  { text: '答应', link: '/黑盒圣经/经典/经典2/答应' },
                  { text: '到家了', link: '/黑盒圣经/经典/经典2/到家了' },
                  { text: '多了个儿子', link: '/黑盒圣经/经典/经典2/多了个儿子' },
                  { text: '腐蚀装', link: '/黑盒圣经/经典/经典2/腐蚀装' },
                  { text: '改成一号', link: '/黑盒圣经/经典/经典2/改成一号' },
                  { text: '感觉有点难受', link: '/黑盒圣经/经典/经典2/感觉有点难受' },
                  { text: '搞笑', link: '/黑盒圣经/经典/经典2/搞笑' },
                  { text: '给台阶', link: '/黑盒圣经/经典/经典2/给台阶' },
                  { text: '孤儿', link: '/黑盒圣经/经典/经典2/孤儿' },
                  { text: '哈喽', link: '/黑盒圣经/经典/经典2/哈喽' },
                  { text: '和好了', link: '/黑盒圣经/经典/经典2/和好了' },
                  { text: '黑大帅', link: '/黑盒圣经/经典/经典2/黑大帅' },
                  { text: '很好看', link: '/黑盒圣经/经典/经典2/很好看' },
                  { text: '哄你睡', link: '/黑盒圣经/经典/经典2/哄你睡' },
                  { text: '换一家', link: '/黑盒圣经/经典/经典2/换一家' },
                  { text: '兼职', link: '/黑盒圣经/经典/经典2/兼职' },
                  { text: '介意', link: '/黑盒圣经/经典/经典2/介意' },
                  { text: '今天晚上', link: '/黑盒圣经/经典/经典2/今天晚上' },
                  { text: '看着表哭', link: '/黑盒圣经/经典/经典2/看着表哭' },
                  { text: '老师', link: '/黑盒圣经/经典/经典2/老师' },
                  { text: '买东西吃', link: '/黑盒圣经/经典/经典2/买东西吃' },
                  { text: '没把你当', link: '/黑盒圣经/经典/经典2/没把你当' },
                  { text: '没分啊', link: '/黑盒圣经/经典/经典2/没分啊' },
                  { text: '没人要', link: '/黑盒圣经/经典/经典2/没人要' },
                  { text: '能吃雪糕哦', link: '/黑盒圣经/经典/经典2/能吃雪糕哦' },
                  { text: '你没有手嘛', link: '/黑盒圣经/经典/经典2/你没有手嘛' },
                  { text: '你特么是谁', link: '/黑盒圣经/经典/经典2/你特么是谁' },
                  { text: '牛奶还要吗', link: '/黑盒圣经/经典/经典2/牛奶还要吗' },
                  { text: '暖她一整天', link: '/黑盒圣经/经典/经典2/暖她一整天' },
                  { text: '删了嘛', link: '/黑盒圣经/经典/经典2/删了嘛' },
                  { text: '谁把我兑换码用了', link: '/黑盒圣经/经典/经典2/谁把我兑换码用了' },
                  { text: '声音不好听', link: '/黑盒圣经/经典/经典2/声音不好听' },
                  { text: '双眼全息投影', link: '/黑盒圣经/经典/经典2/双眼全息投影' },
                  { text: '死了吗', link: '/黑盒圣经/经典/经典2/死了吗' },
                  { text: '送你了', link: '/黑盒圣经/经典/经典2/送你了' },
                  { text: '疼', link: '/黑盒圣经/经典/经典2/疼' },
                  { text: '痛快话', link: '/黑盒圣经/经典/经典2/痛快话' },
                  { text: '头像', link: '/黑盒圣经/经典/经典2/头像' },
                  { text: '玩具', link: '/黑盒圣经/经典/经典2/玩具' },
                  { text: '忘不了', link: '/黑盒圣经/经典/经典2/忘不了' },
                  { text: '为什么', link: '/黑盒圣经/经典/经典2/为什么' },
                  { text: '我随孩子姓', link: '/黑盒圣经/经典/经典2/我随孩子姓' },
                  { text: '喜欢', link: '/黑盒圣经/经典/经典2/喜欢' },
                  { text: '先别一直发', link: '/黑盒圣经/经典/经典2/先别一直发' },
                  { text: '先在一起', link: '/黑盒圣经/经典/经典2/先在一起' },
                  { text: '相亲', link: '/黑盒圣经/经典/经典2/相亲' },
                  { text: '想吃啥', link: '/黑盒圣经/经典/经典2/想吃啥' },
                  { text: '辛巴', link: '/黑盒圣经/经典/经典2/辛巴' },
                  { text: '学长', link: '/黑盒圣经/经典/经典2/学长' },
                  { text: '要不', link: '/黑盒圣经/经典/经典2/要不' },
                  { text: '一见钟情', link: '/黑盒圣经/经典/经典2/一见钟情' },
                  { text: '意下如何', link: '/黑盒圣经/经典/经典2/意下如何' },
                  { text: '有人先答应了', link: '/黑盒圣经/经典/经典2/有人先答应了' },
                  { text: '有意思', link: '/黑盒圣经/经典/经典2/有意思' },
                  { text: '缘分', link: '/黑盒圣经/经典/经典2/缘分' },
                  { text: '早点认识她', link: '/黑盒圣经/经典/经典2/早点认识她' },
                  { text: '只是爱他的钱', link: '/黑盒圣经/经典/经典2/只是爱他的钱' },
                  { text: '至少得6个人', link: '/黑盒圣经/经典/经典2/至少得6个人' },
                  { text: '种草莓', link: '/黑盒圣经/经典/经典2/种草莓' },
                  { text: '自闭症', link: '/黑盒圣经/经典/经典2/自闭症' },
                  { text: '昨晚上分了', link: '/黑盒圣经/经典/经典2/昨晚上分了' },
                  { text: 'hs网站', link: '/黑盒圣经/经典/经典2/hs网站' },
                  { text: 'p站', link: '/黑盒圣经/经典/经典2/p站' },
                  { text: 'rua', link: '/黑盒圣经/经典/经典2/rua' },
                ]
              },
              {
                text: '为什么不说话合集',
                collapsed: true,
                items:[
                  { text: '不说话', link: '/黑盒圣经/经典/为什么不说话合集/不说话' },
                  { text: '你怎么不说话', link: '/黑盒圣经/经典/为什么不说话合集/你怎么不说话'},
                  { text: '为什么不回我', link: '/黑盒圣经/经典/为什么不说话合集/为什么不回我' },
                  { text: '为什么不说话', link: '/黑盒圣经/经典/为什么不说话合集/为什么不说话' },
                ]
              },
              {
                text: '细节合集',
                collapsed: true,
                items:[
                  { text: '细节1', link: '/黑盒圣经/经典/细节合集/细节1' },
                  { text: '细节2', link: '/黑盒圣经/经典/细节合集/细节2' },
                  { text: '细节3', link: '/黑盒圣经/经典/细节合集/细节3' },
                  { text: '细节4', link: '/黑盒圣经/经典/细节合集/细节4' },
                  { text: '细节5', link: '/黑盒圣经/经典/细节合集/细节5' },

                  { text: '细节6', link: '/黑盒圣经/经典/细节合集/细节6' },
                  { text: '细节7', link: '/黑盒圣经/经典/细节合集/细节7' },
                  { text: '细节8', link: '/黑盒圣经/经典/细节合集/细节8' },
                  { text: '细节9', link: '/黑盒圣经/经典/细节合集/细节9' },
                  { text: '细节10', link: '/黑盒圣经/经典/细节合集/细节10' },

                  { text: '细节11', link: '/黑盒圣经/经典/细节合集/细节11' },
                  { text: '细节12', link: '/黑盒圣经/经典/细节合集/细节12' },
                  { text: '细节13', link: '/黑盒圣经/经典/细节合集/细节13' },
                  { text: '细节14', link: '/黑盒圣经/经典/细节合集/细节14' },
                ]
              },
              {
                text: '网友制作合集',
                collapsed: true,
                items:[
                  { text: '网友制作合集1', link: '/黑盒圣经/经典/网友制作合集/网友制作合集1' },
                  { text: '网友制作合集2', link: '/黑盒圣经/经典/网友制作合集/网友制作合集2' },
                  { text: '网友制作合集3', link: '/黑盒圣经/经典/网友制作合集/网友制作合集3' },
                  { text: '网友制作合集4', link: '/黑盒圣经/经典/网友制作合集/网友制作合集4' },
                ]
              },
            ]   
          },
        ]
      },

      { 
        text: '皮特弹幕',
        collapsed: true,
        items: [
          { text: '皮特弹幕', link: '/pite/index' },
        ]
      },
    ],

    socialLinks: [
      { icon: 'github', link: 'https://github.com/heygsc/xiaoheihe-literature' }
    ]
  }
})
